# Prefix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionType..::..Prefix Property
DimensionType Class See Also
---
The prefix text for the dimension value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public string Prefix { get; set; }
```

Visual Basic
---
```text
Public Property Prefix As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The text goes immediately before the value and is not overridden by the possible instance prefix.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DimensionType Class
Autodesk.Revit.DB Namespace